

fantasy = 'Гарри Поттер, Аватар, Властелин кольца, Звездные войны, Люди Икс, Человек Паук, Мстители, Чебурашка, Пираты карибского моря, Веном, Престиж, Призрачный город, Морозко, Мумия, Брюс всемогущий, Телепорт, Константин повелитель тьмы, Скотт Пилигримм против всех, Господин никто, Ведьма, Доктор Стрендж, Железный человек, Тор, Стражи галактики, Капитан Марвел, Он - дракон, Мег - монстр глубин, Spider show, Аквамен'.split(', ')
horror = 'Дом 2, Пиковая дама, Астрал, Я видел дьявола, Мгла, Пила, 28 дней спустя, Сайлент Хилл, Крик, Не дыши, Из ада, Тихое место'.split(', ')
camedy = 'Американский пирог, Дружить по-русски, Очень страшное кино, Агент Джони Инглиш, Не грози южному централу, Иван Васильевич меняет профессию, Холоп, Эйс Вентура, Муви 43, Самый лучший день, Самый лучший фильм, Полицейский с рублевки, Укращение страптивого, Мальчишник в Вегасе, Невероятная жизнь Уолтера Митти, '.split(', ')
roman = 'Титаник, Елки, После, Мой любимый враг, Сумерки, 3 метра над уровнем неба, Великий Гэтсби, Фокус'.split(', ')
historic = '9 рота, Брестская крепость, Калашников, Летчик, Т-34, Сволочи, Битва за Севастополь'.split(', ')
mults = 'Ледниковый период, Душа, Головоломка, Лило и Стич, Как приручить дракона'.split(', ')
dogs = 'Хатико, Собачья жизнь, Путь домой, Невероятный мир глазами Энцо, Бетховен'.split(', ')
serial = 'Lost, Ривердейл, Побег, Грозовые ворота, Спецназ, Ходячие мертвецы, Сверхъестественное, Бригада, Трудные подростки, Жуки, Половое воспитание, Скинс, Полицейский с рублевки, Территория, Игра на выживание, Игра престолов'.split(', ')
