# Подвиг - № 7
# Выводятся номера телефонов в одну строчку через пробел с разными кодами стран: +7, +6, +2, +4
# Необходимо составить словарь d, где ключи - это коды стран, а значения - список номеров.
# Полученный словарь вывести командой print(*sorted(d.items()))

# +71234567890 +41234567890 +72345678141 +22134567890 +61234567890 +62345678901 +21234567890 

string = '+71234567890 +41234567890 +72345678141 +22134567890 +61234567890 +62345678901 +21234567890'
numbers = []
numbers = string.split()

a = '+7'
b = '+6'
c = '+2'
x = '+4'

aa = []
bb = []
cc = []
xx = []

for i in numbers:
    if i.__contains__(a):
        aa.append(i)
    if i.__contains__(b):
        bb.append(i)
    if i.__contains__(c):
        cc.append(i)
    if i.__contains__(x):
        xx.append(i)

dict = {
    a: aa, b: bb, c: cc, x: xx
}

print(*sorted(dict.items()))